## Terraform checks in directory 'infra'
#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`
[0m[1mInitializing the backend...[0m
[0m[32m
Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.[0m

[0m[1mInitializing provider plugins...[0m
- Finding cloudflare/cloudflare versions matching "~> 4.0"...
- Installing cloudflare/cloudflare v4.26.0...
- Installed cloudflare/cloudflare v4.26.0 (self-signed, key ID [0m[1mC76001609EE3B136[0m[0m)

Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html

[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m
[0m[32m
You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.[0m
`
#### Terraform Plan 📖`cloudflare_zone.kubefest: Refreshing state... [id=5669809675bbe5d4964de88798226f5e]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudflare_record.kubefest_com will be created
  + resource "cloudflare_record" "kubefest_com" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "kubefest.com"
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = "cloudnativerioja.github.io"
      + zone_id         = "kubefest.com"
    }

  # cloudflare_record.www_kubefest_com will be created
  + resource "cloudflare_record" "www_kubefest_com" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "www"
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = "cloudnativerioja.github.io"
      + zone_id         = "kubefest.com"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
`